app/Models/M_databarang.php

    public function laporandatabarangmasuk()
    {
        $builder = $this->db->table('barangmasuk');
        $query = $builder->get();
---
SELECT *
FROM `barangmasuk`

    public function itemcount()
    {
        $builder = $this->db->table('databarang');
        return $builder->groupStart() // Memulai grup kondisi
                        ->where('jumlah <=', 10)->where('satuan', 'pcs') // Kondisi 1: jumlah <= 0
                        ->orWhere('jumlah <=', 20)->where('satuan', 'ampul') // Kondisi 2: jumlah <= 20
                        ->orWhere('jumlah <=', 200)->where('satuan', 'ml') // Kondisi 3: jumlah <= 200
                        ->orWhere('jumlah <=', 10)->where('satuan', 'vial') // Kondisi 4: jumlah <= 10
                        ->groupEnd() // Mengakhiri grup kondisi
                        ->get()->getResultArray(); // Menghitung jumlah row yang memenuhi kondisi
---
SELECT *
FROM `databarang`
WHERE   (
`jumlah` <= 10
AND `satuan` = 'pcs'
OR `jumlah` <= 20
AND `satuan` = 'ampul'
OR `jumlah` <= 200
AND `satuan` = 'ml'
OR `jumlah` <= 10
AND `satuan` = 'vial'
 )

    public function cekexpired()
    {
        $builder = $this->db->table('databarang');
        // Ambil data barang yang expired atau akan expired dalam 4 bulan
        return $builder->where('expired <=', date('Y-m-d'))
                        ->orWhere('expired <=', date('Y-m-d', strtotime('+4 months')))
                        ->get()->getResultArray(); // Mengembalikan data barang yang expired
---
SELECT *
FROM `databarang`
WHERE `expired` <= '2024-11-15'
OR `expired` <= '2025-03-15'